/**********************************************************************
 Nexcom Co., Ltd.
 Filename         : csu_Encoder.h
 Version          : 00.01
 Description      : AksIM-2 엔코더 어플리케이션 기능 처리 모듈
 Programmer       : Kim Jeonghwan
 Last Updated     : 2026. 06. 09. (신규 생성)
**********************************************************************/

#ifndef CSU_ENCODER_H_
#define CSU_ENCODER_H_

#include "main.h"
#include "hal_Encoder.h"

#ifdef __cplusplus
extern "C" {
#endif

//---------------------------------------------------------------------------
// 매크로
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
// 전역 변수
//---------------------------------------------------------------------------
extern uint32_t encPosition;

//---------------------------------------------------------------------------
// 함수 프로토타입
//---------------------------------------------------------------------------
extern void Encoder_Init(void);
extern void Encoder_UpdatePosition(void);

#ifdef __cplusplus
}
#endif

#endif /* CSU_ENCODER_H_ */
