/**********************************************************************
    Nexcom Co., Ltd.
    Filename         : hal_DspInit.h
    Version          : 00.01
    Description      : CPU1 마스터 초기화 헤더
    Programmer       : Kim Jeonghwan
    Last Updated     : 2026. 06. 11. (DSP_Initialization 함수명을 System_Initialization으로 변경)
**********************************************************************/

/*
 * Modification History
 * --------------------
 * 
 * 
*/


#ifndef HAL_DSPINIT_H
#define HAL_DSPINIT_H

/* ************************** [[   include  ]]  *********************************************************** */
#include "main.h"


/* ************************** [[   define   ]]  *********************************************************** */



/* ************************** [[   enum or struct   ]]  *************************************************** */



/* ************************** [[   global   ]]  *********************************************************** */



/* ************************** [[  function  ]]  *********************************************************** */
/*   시스템 전반 초기화   */
void System_Initialization(void);


#endif	// #ifndef HAL_DSPINIT_H

