/**********************************************************************
    Nexcom Co., Ltd.
    Filename         : hal_DspInit.h
    Version          : 00.01
    Description      : CPU1 마스터 초기화 헤더
    Programmer       : Kim Jeonghwan
    Last Updated     : 2026. 06. 11. (주석 표준화 및 레거시 코드 정리)
**********************************************************************/

/*
 * Modification History
 * --------------------
 * 2026. 06. 11. - 주석 표준화 및 레거시 코드 정리
 */


#ifndef HAL_DSPINIT_H
#define HAL_DSPINIT_H

/* ************************** [[   include  ]]  *********************************************************** */
#include "main.h"


/* ************************** [[   define   ]]  *********************************************************** */



/* ************************** [[   enum or struct   ]]  *************************************************** */



/* ************************** [[   global   ]]  *********************************************************** */



/* ************************** [[  function  ]]  *********************************************************** */
/**
 * @brief      DSP 및 주변장치 초기화 수행의 진입점
 * @param      void
 * @return     void
 */
void System_Initialization(void);


#endif	// #ifndef HAL_DSPINIT_H

